Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::AngleSetBase::Modifier Class Reference
MEP Element Manager
Modifier of the AngleSetBase. More...
#include <MEPAngleSetBase.hpp>
 Inheritance diagram for ACAPI::MEP::AngleSetBase::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &angleSetName)
Sets the name of the angleSet.
Result< uint32_t >  | Add (double angle)
Adds a new angle into the angleSet. If the id is a duplicate, it will not be inserted twice.
Result< void >  | Delete (double angle)
Deletes an entry from the angleSet. Only undefined angles can be deleted. A angle is defined if at least one preferenceTable has values associated to it.
 Protected Member Functions
Modifier (AngleSetBase &parent)
Constructs a Modifier with the given angleSetBase.
Detailed Description
Modifier of the AngleSetBase.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::AngleSetBase::Modifier::Modifier  |  ( |  AngleSetBase & |  parent | )
protected
Constructs a Modifier with the given angleSetBase.
Parameters
parent | The given parent AngleSetBase.
Member Function Documentation
◆ Add()
 Result< uint32_t > ACAPI::MEP::AngleSetBase::Modifier::Add  |  ( |  double |  angle | )
Adds a new angle into the angleSet. If the id is a duplicate, it will not be inserted twice.
Parameters
angle | The angle to be added.
Returns
Returns error if the angle is a duplicate, otherwise returns the index of the angle in the angleSet.
◆ Delete()
 Result< void > ACAPI::MEP::AngleSetBase::Modifier::Delete  |  ( |  double |  angle | )
Deletes an entry from the angleSet. Only undefined angles can be deleted. A angle is defined if at least one preferenceTable has values associated to it.
Parameters
angle | The angle to be deleted.
Returns
Returns error if the id cannot be deleted due to reasons mentioned above, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::AngleSetBase::Modifier::SetName  |  ( |  const GS::UniString & |  angleSetName | )
Sets the name of the angleSet.
Parameters
angleSetName | The name to be set.